export const deviceIds = ['201', '203']

export const deviceIdToName = {
    '201': '壱号機', '202': '弐号機', '203': '参号機', '204': '肆号機', '205': '伍号機',
}

export const deviceIdToDBName = {
    '201': '1go', '202': '2go', '203': '3go', '204': '4go', '205': '5go',
}

export const widthThresholdPx = 600;

export const isoList = [100, 200, 400, 800, 1600, 3200, 6400, 12800, 25600]
export const fNumberList = [4.8, 5, 5.6, 6.3, 7.1, 8, 9, 1, 11, 13, 14, 16, 18, 2, 22, 25] //TODO set with f/%d
export const ssList = [0.2, 0.3, 0.4, 0.5, 0.6, 0.8, 1, 1.2, 1.5, 2, 2.5, 3.1, 4, 5, 6.2, 8, 10, 12.5, 16.6, 20, 25, 33.3, 40, 50, 66.6, 76.8, 100, 125, 166.6, 200, 250, 333.3, 400, 500, 625, 769.2, 1000, 1300, 1600, 2000, 2500, 3000, 4000, 5000, 6000, 8000, 10000, 13000, 15000, 20000, 25000, 30000]